n = input()  # Вводим число как строку
result = int(n) + int(n * 2) + int(n * 3)  # Складываем n, nn и nnn
print(result)  # Выводим результат

""" Размножение n-ок
Напишите программу, которая считывает целое положительное число 

n(n∈[1;9]) и выводит значение числа n+nn+nnn


Формат входных данных
На вход программе подаётся одно целое положительное число 

n(n∈[1;9]).

Формат выходных данных
Программа должна вывести число 
n+nn+nnn

Примечание. Для первого теста 

1+11+111=123. """