n = int(input())
print("*" * 19)  # Верхняя граница
for _ in range(n - 2):  # Средние строки
    print("*" + " " * 17 + "*")
print("*" * 19)  # Нижняя граница


""" Звёздная рамка 🌟
На вход программе подаётся натуральное число 

n(n∈[3;19]). Напишите программу, которая печатает звёздную рамку размерами 

n×19.

Формат входных данных
На вход программе подаётся натуральное число 

n(n∈[3;19]) – высота звёздной рамки.

Формат выходных данных
Программа должна вывести звёздную рамку размерами 

n×19.

Подсказка. Для печати звёздной линии используйте умножение строки на число. """
