n = int(input())
str = []
for i in range(n):
    a = input()
    str.append(a)

print(str)

""" Список строк
На вход программе подаются натуральное число 
n
n, а затем 
n
n строк. Напишите программу, которая создаёт из указанных строк список, а затем выводит его.

Формат входных данных
На вход программе подаются натуральное число 
n
n, а затем 
n
n строк, каждая на отдельной строке.

Формат выходных данных
Программа должна вывести список, состоящий из указанных строк. """