numbers = [i**2 for i in range(1, int(input()) + 1)]
print(*numbers, sep="\n")


""" Списочное выражение 1
На вход программе подаётся натуральное число 
n. Напишите программу, использующую списочное выражение, которая создаёт список, содержащий квадраты чисел от 
1 до 
n (включительно), а затем выводит его элементы построчно, то есть каждый на отдельной строке.

Формат входных данных
На вход программе подаётся натуральное число.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.

Примечание. Для вывода элементов списка используйте цикл for. """