n = int(input())
number = list(range(1, n + 1))
print(number)


""" Список чисел
На вход программе подаётся одно число 
n
n. Напишите программу, которая выводит список [1, 2, 3, ..., n].

Формат входных данных
На вход программе подаётся одно натуральное число.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи. """
