n = input()
numbers = map(int, n.split())

for num in numbers:
    print("+" * num)


""" Диаграмма
На вход программе подаётся строка текста, содержащая целые числа. Напишите программу, которая по заданным числам строит столбчатую диаграмму.

Формат входных данных
На вход программе подаётся строка текста, содержащая целые числа, разделённые символом пробела.

Формат выходных данных
Программа должна вывести столбчатую диаграмму. """
