n = int(input())
array = []
for i in range(n):
    a = input()
    array.extend(a)

print(array)


""" Символы всех строк
На вход программе подаются натуральное число 
n
n, а затем 
n
n строк. Напишите программу, которая создает список из символов всех строк, а затем выводит его.

Формат входных данных
На вход программе подаются натуральное число 
n
n, а затем 
n
n строк, каждая на отдельной строке.

Формат выходных данных
Программа должна вывести список, состоящий из символов всех введённых строк.

Примечание. В результирующем списке могут содержаться одинаковые символы. """
