n = list(map(int, input().split()))
n.sort()
print(*n)
n.sort(reverse=True)
print(*n)


""" Сортировка чисел
На вход программе подаётся строка текста, содержащая целые числа. Из данной строки формируется список чисел. Напишите программу, которая сортирует и выводит данный список сначала по возрастанию, а затем по убыванию.

Формат входных данных
На вход программе подаётся строка текста, содержащая целые числа, разделённые символом пробела.

Формат выходных данных
Программа должна вывести две строки текста в соответствии с условием задачи. """