a = int(input())
if -30 < a <= -2 or 7 < a <= 25:
    print('Принадлежит')
else:
    print('Не принадлежит')





""" Принадлежность 3
Напишите программу, которая принимает целое число x и определяет, принадлежит ли данное число указанным промежуткам.

Формат входных данных
На вход программе подаётся целое число x.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.

-30 до -2 включительно или от 7 до 25 включительно

Примечание. Если точка выколотая, то граница не включается, если точка закрашенная, то граница включается.  """