a = int(input())
if -10000 <= a <= -3 or 7 <= a <= 10000:
    print('Принадлежит')
else:
    print('Не принадлежит')


""" Принадлежность 2
Напишите программу, которая принимает целое число 
x и определяет, принадлежит ли данное число указанным промежуткам.

Формат входных данных
На вход программе подаётся целое число x.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.
- 99 -3 и 7 99


Примечание. Если точка выколотая, то граница не включается, если точка закрашенная, то граница включается.  """