a = int(input())
if 0 <= a and a <= 16:
    print('Принадлежит')
else:
    print('Не принадлежит')


""" Принадлежность 1
Напишите программу, которая принимает целое число x и определяет, принадлежит ли данное число указанному промежутку. 

Формат входных данных
На вход программе подаётся целое число x.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи. -1 до 17 """

