str1 = input()
for i in range(0, len(str1), 2):
    print(str1[i])

""" В столбик 1
На вход программе подаётся одна строка. Напишите программу, которая выводит элементы строки с индексами 0, 2, 4, ... в столбик.

Формат входных данных
На вход программе подаётся одна строка.

Формат выходных данных
Программа должна вывести элементы строки с индексами 0, 2, 4, ..., каждое на отдельной строке. """