a = input()
print(len(a), a * 3, a[0], a[0:3], a[-3:], a[::-1], a[1:-1], sep="\n")


""" Делаем срезы 1
На вход программе подаётся одна строка. Напишите программу, которая выводит:

общее количество символов в строке;
исходную строку, повторённую 
3 раза;
первый символ строки;
первые три символа строки;
последние три символа строки;
строку в обратном порядке;
строку с удалённым первым и последним символами.
Формат входных данных
На вход программе подаётся одна строка, длина которой больше 
3 символов.

Формат выходных данных
Программа должна вывести данные в соответствии с условием. Каждое значение выводится на отдельной строке. """
