s = input()  # Вводим строку
cnt = 0
total = 0

# Таблица замены латинских букв на русские (похожие по написанию)
eng = 'eyoapxcETOPAHXCBM'
rus = 'еуоархсЕТОРАНХСВМ'  # Русские аналоги

# Считаем "старую стоимость" (сумму Unicode-кодов, умноженную на 3)
for j in range(len(s)):
    cnt += ord(s[j]) * 3
print("Старая стоимость:", str(cnt) + chr(128029))  # 🗿

# Делаем замену букв
s1 = s  # Начинаем с исходной строки
for i in range(len(eng)):
    s1 = s1.replace(eng[i], rus[i])  # Заменяем буквы из eng на русские

# Считаем "новую стоимость"
for k in range(len(s1)):
    total += ord(s1[k]) * 3
print("Новая стоимость:", str(total) + chr(128029))  # 🗿

""" Накручиваем стоимость ответа ⬆️🌶️
Как вы помните из прошлой задачи, модератору Сэму за каждый символ его сообщений в комментариях Тимур платит в 🐝 (пчёлках-coin) по следующему тарифу:

<код символа в таблице Unicode>
×
3
🐝
<код символа в таблице Unicode>×3🐝

А стоимость всего сообщения складывается из суммы стоимостей всех символов. На этот раз Сэму захотелось схитрить и попробовать увеличить стоимость своего сообщения, заменив в нем некоторые английские буквы на русские. Как вы помните, русские буквы в таблице Unicode находятся после английских.

Сэм хочет заменить следующие английские буквы:

eyopaxcETOPAHXCBM
на соответствующие им русские буквы:

еуорахсЕТОРАНХСВМ
Тимур визуально разницу не заметит, а Сэм сможет зарабатывать больше пчёлок-coin. 😊

На вход программе подаётся строка текста. Требуется написать программу, которая находит стоимость старого и нового сообщений Сэма в 🐝 и выводит текст в следующем формате:

Старая стоимость: <стоимость старого сообщения>🐝
Новая стоимость: <стоимость нового сообщения>🐝
Формат входных данных
На вход программе подаётся строка текста – очередной ответ Сэма в комментариях.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи.

Примечание. Обратите внимание, что если в строке не удаётся заменить буквы, то стоимость сообщения не изменится. 😢 """