number = input()
total = 0
for i in range(len(number)):
    total += int(number[i])
    print()

print(total) 

""" Цифра 1
На вход программе подаётся одна строка состоящая из цифр. Напишите программу, которая считает сумму цифр данной строки.

Формат входных данных
На вход программе подаётся одна строка, состоящая из цифр.

Формат выходных данных
Программа должна вывести сумму цифр данной строки. """