a, b, c, d, e = int(input()), int(input()), int(input()), int(input()), int(input())
s = max(a, b, c, d, e)
f = min((a, b, c, d, e))
print("Наименьшее число =", f)
print("Наибольшее число =", s)

""" Наибольшее и наименьшее
Напишите программу, которая находит наименьшее и наибольшее из пяти чисел и выводит текст в следующем формате:

Наименьшее число = <наименьшее число>
Наибольшее число = <наибольшее число>
Формат входных данных
На вход программе подаются 5 целых чисел, каждое на отдельной строке.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи. """