from math import floor, ceil
a = float(input())
a1 = floor(a)
a2 = ceil(a) 
print(a1 + a2)

""" Пол и потолок
Напишите программу, которая принимает на вход действительное число 
⌊x⌋ – пол числа (округление x до ближайшего целого в меньшую сторону), 

⌈x⌉ – потолок числа (округление 
x до ближайшего целого в большую сторону). """

