num = int(input())
a = num % 10
b = (num % 100) // 10
c = num // 100
if max(a, b, c) - min(a, b, c) == (a + b + c) - max(a, b, c) - min(a, b, c):
    print("Число интересное")
else:
    print("Число неинтересное")


""" Интересное число 🤔
Назовём число интересным, если в нём разность максимальной и минимальной цифры равняется средней по величине цифре. Напишите программу, которая определяет, интересное число или нет. Если число интересное, следует вывести текст «Число интересное» (без кавычек), иначе – «Число неинтересное» (без кавычек).

Формат входных данных
На вход программе подается целое трёхзначное число.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи. """
