import math
x1, y1 = float(input()), float(input())
x2, y2 = float(input()), float(input())
print(math.sqrt((math.pow(x1 - x2, 2) + math.pow(y1 - y2, 2))))


""" Евклидово расстояние 📏
На плоскости евклидово расстояние между двумя точками 


Напишите программу, определяющую евклидово расстояние между двумя точками, координаты которых заданы.

Формат входных данных
На вход программе подаются четыре действительных числа, каждое на отдельной строке – 


Формат выходных данных
Программа должна вывести одно число – евклидово расстояние. """
