a, b, c = input(), input(), input()
min_city = min(a, b, c, key=len)
max_city = max(a, b, c, key=len)
print(min_city, max_city, sep='\n')

""" Три города 🏙️
Даны названия трёх городов. Напишите программу, которая определяет самое короткое и самое длинное название города.

Формат входных данных
На вход программе подаются названия трёх городов, каждое на отдельной строке.

Формат выходных данных
Программа должна вывести самое короткое и длинное название города, каждое на отдельной строке.

Примечание. Гарантируется, что длины названий всех трёх городов различны. """