s, v1, v2 = float(input()), float(input()), float(input())

v = v1 + v2
q = s / v
print(q)




""" Две старушки идут навстречу друг другу с постоянными скоростями 
v1 v2 км/ч. Определите, через какое время (в часах) старушки встретятся, если расстояние между ними равно S км.



Формат входных данных
На вход программе подаются три действительных числа 
S ,V1 v2 , каждое на отдельной строке.

Формат выходных данных 
Программа должна вывести одно число в соответствии с условием задачи.

Примечание. Это очень быстрые старушки. 🚀 """