a, b, c = int(input()), int(input()), int(input())
mi = min(a, b, c)
ma = max(a, b, c)
s = (a + b + c) - (mi + ma)
print(ma, s, mi, sep='\n')


""" Сортировка трёх 🔀🌶️
Напишите программу, которая упорядочивает три числа от большего к меньшему.

Формат входных данных
На вход программе подаются три целых числа, каждое на отдельной строке.

Формат выходных данных
Программа должна вывести три числа, каждое на отдельной строке, упорядоченных от большего к меньшему.

Примечание. Учитывайте, что числа могут быть равны. """
