a, b, c, d, e = abs(float(input())), abs(float(input())), abs(float(input())), abs(float(input())), abs(float(input()))
print(a + b + c + d + e) 




""" Абсолютная сумма
Даны пять чисел 
a1 a2 a3 a4 a5 . Напишите программу, которая вычисляет сумму их модулей 


Формат входных данных
На вход программе подаются пять действительных чисел 
a1 a2 a3 a4 a5, каждое на отдельной строке.

Формат выходных данных
Программа должна вывести одно число – сумму модулей введённых чисел. """