from math import pi

R = float(input())
S = pi * (R**2)
C = 2 * pi * (R)
print(S, C, sep='\n')

""" Площадь и длина
Напишите программу, определяющую площадь круга и длину окружности по заданному радиусу R.

Формат входных данных
На вход программе подаётся одно действительное число R​.

Формат выходных данных
Программа должна вывести два числа (каждое на отдельной строке) – площадь круга и длину окружности радиуса R.


Примечание. Используйте константу math.pi.  """
