n = int(input())
for _ in range(1, n // 2 + 2):
    print("*" * _)
for k in range(n // 2, 0, -1):
    print("*" * k)


""" Звёздный треугольник 🌟🌶️🌶️
Дано нечётное натуральное число 
n. Напишите программу, которая печатает равнобедренный звёздный треугольник с основанием, равным 
n, в соответствии с примером: """
