a = int(input())
for i in range(a):
    print('*' * 19)



""" Звёздный прямоугольник ⭐
На вход программе подаётся натуральное число 

Напишите программу, которая печатает звёздный прямоугольник размерами 

Формат входных данных
На вход программе подаётся натуральное число 
n(n∈[1;20]) – высота звёздного прямоугольника.

Формат выходных данных
Программа должна вывести звёздный прямоугольник размерами 

n×19.

Подсказка. Для печати звёздной линии используйте умножение строки на число. """