a = int(input())
while a != 0:
    last_digit = a % 10
    print(last_digit)
    a //= 10


""" Обратный порядок 1
Дано натуральное число. Напишите программу, которая выводит его цифры в столбик в обратном порядке.

Формат входных данных
На вход программе подаётся одно натуральное число.

Формат выходных данных
Программа должна вывести цифры введённого числа в столбик в обратном порядке. """
