n = int(input())
for i in range(n):
    for j in range(i + 1):
        print(i + 1, end="")
    print()


""" Численный треугольник 1
Дано натуральное число 
n
n. Напишите программу, которая печатает численный треугольник в соответствии с примером:

1
22
333
4444
55555
... """
