a = int(input())
for i in range(a + 1):
    print("Квадрат числа", i, "равен", i**2)


""" Квадрат числа
На вход программе подаётся натуральное число 
n. Напишите программу, которая для каждого из чисел от 
0 до n
n (включительно) выводит текст в следующем формате:

Квадрат числа <текущее число> равен <квадрат текущего числа>
Формат входных данных
На вход программе подаётся натуральное число n.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи. """
