n = input()  # Получаем число как строку
n = n.replace("1", "one")  # Заменяем все "1" на "one"
print(n)  # Выводим результат


""" Замени меня полностью 🔄
На вход программе подаётся строка текста. Напишите программу, которая заменяет все вхождения цифры 
1
1 на слово «one».

Формат входных данных 
На вход программе подаётся строка текста.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи. """
