text = input()
clean_text = text.replace("@", "")
print(clean_text)  # Вывод: Пример текста с символами


""" Удали меня полностью ❌
На вход программе подаётся строка текста. Напишите программу, которая удаляет все вхождения символа «@».

Формат входных данных 
На вход программе подаётся строка текста.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи. """
