import re

s = input().strip()

pattern1 = r"\d{3}-\d{3}-\d{4}"    # формат abc-def-hijk
pattern2 = r"7-\d{3}-\d{3}-\d{4}"   # формат 7-abc-def-hijk

if re.fullmatch(pattern1, s) or re.fullmatch(pattern2, s):
    print("YES")
else:
    print("NO")




""" Валидный номер 📞🌶️🌶️
На вход программе подаётся строка текста. Напишите программу, которая определяет, является ли введённая строка корректным телефонным номером. Строка текста является корректным телефонным номером, если она соответствует одному из следующих форматов:

abc-def-hijk
7-abc-def-hijk
где a, b, c, d, e, f, h, i, j, k – цифры от 
0
0 до 
9
9.

Формат входных данных
На вход программе подаётся строка текста.

Формат выходных данных
Программа должна вывести «YES» (без кавычек), если строка является корректным телефонным номером, или «NO» (без кавычек) в противном случае.

Примечание. Телефонный номер должен содержать только цифры и символ -, а количество цифр в каждой группе должно быть правильным. """