n = int(input())
ch = []
num = 2
while num <= n:
    ch.append(num)
    num += 2
print(ch)


""" Список чётных
На вход программе подаётся чётное число 
n(n≥2). Напишите программу, которая выводит список чётных чисел:

 [2, 4, 6, ..., n].

Формат входных данных
На вход программе подаётся чётное натуральное число.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи. """
