a = int(input())
b = int(input())
c = int(input())
sum = a + b + c
print(sum)

""" Сумма трёх чисел
Напишите программу, которая считывает три целых числа и выводит на экран их сумму. Каждое число записано в отдельной строке.

Формат входных данных
На вход программе подаются три целых числа, каждое на отдельной строке.

Формат выходных данных
Программа должна вывести сумму введённых чисел. """