x = int(input())
x2 = x * 2
x3 = x * 3
x4 = x * 4
x5 = x * 5
print(x, end="---")
print(x2, end="---")
print(x3, end="---")
print(x4, end="---")
print(x5)

""" Разделяй и властвуй 👑
Напишите программу, которая считывает целое положительное число x и выводит на экран последовательность чисел  x,2x,3x,4x и 5x, разделённых тремя чёрточками -.

Формат входных данных
На вход программе подаётся целое положительное число x.

Формат выходных данных
Программа должна вывести текст в соответствии с условием задачи. """