print('4' , '8' , '15' , '16' , '23' , '42')

""" Счастливая последовательность 1 🍀
В популярном сериале «Остаться в живых» использовалась последовательность чисел «4 8 15 16 23 42», которая принесла героям удачу и помогла сорвать джекпот в лотерее. Напишите программу, которая выводит данную последовательность чисел с одним пробелом между ними.

Примечание. В чистом виде текст '4 8 15 16 23 42' нельзя использовать. Вместо этого воспользуйтесь возможностью команды print() выводить несколько аргументов, указанных через запятую. """