print('*')
print('**')
print('***')
print('****')
print('*****')
print('******')
print('*******')

""" Звёздный треугольник ⭐
Напишите программу, которая выводит следующий треугольник, состоящий из звёздочек (*):

*
**
***
****
*****
******
******* """